from time import sleep
from random import randint

class Character:
    def __init__(self, name):
        self.name = name
        self.health = 100
        self.damage = 20

    def attack(self, enemy):
        enemy.health -= self.damage
        print(f"\033[31m{self.name} атаковал {enemy.name}, нанеся 20 единиц урона. Здоровье врага: {enemy.health}")


unit1 = Character("Sub-Zero")
unit2 = Character("Scorpion")

print("""\033[35m___  ___              _           _   _____                    _             _   
|  \/  |             | |         | | /  __ \                  | |           | |  
| .  . |  ___   _ __ | |_   __ _ | | | /  \/  ___   _ __ ___  | |__    __ _ | |_ 
| |\/| | / _ \ | '__|| __| / _` || | | |     / _ \ | '_ ` _ \ | '_ \  / _` || __|
| |  | || (_) || |   | |_ | (_| || | | \__/\| (_) || | | | | || |_) || (_| || |_ 
\_|  |_/ \___/ |_|    \__| \__,_||_|  \____/ \___/ |_| |_| |_||_.__/  \__,_| \__|





""")
sleep(2)

print("""\033[31m.........;................................... 
......,:++:.,,............................... 
......+;:+,.;,,.............................. 
..,;:,+:.;;;;:+,....,;?SS*,,................. 
..:;.....,,:;+,..,?%++%@#:;,................ 
..:;,,;,..:::,,,.;+:,:%#S;::................ 
...;::,;:::;,:;,.+,::,:+?%;;................ 
...,::,::+::,:;;.,;:++:,:+S*:................ 
.......:++;::%;;..:;;;;+++?S+:............... 
.......,::,:*S*?,,+:*?*++%#S?+,,............. 
.........,,+@@*+:;;:S%*+***;+*++;;::......... 
.........,:;%S@@?%;?%+;;+*+;+;+?++#?*+;,,... 
.........:;:;;?S?S?%+;;;;:;;:;*+*?+;;*+??;,.. 
.......,;;::,:;*%S@@%*?:,+;,:+;;:...,:,.;.... 
......:;,;::,:;:*+?%%%@S;+;;;;;;;,,.,,..;.... 
......+,.,+:::,.*;:*###@#?*%S?++**;,,;;;,.... 
......:,..,,,,..:?+;+S%?%SS@#S:;?*;:.*?,..... 
.......:,.,+.....;*:;%?S?S@#SS:,:**;:+,...... 
......,+,,.;:.....+?+?:;?@@%+S?,:?**+,....... 
.....,++:,:;*..,,:,*+;+:.??*;S#;;+%%,........ 
.....,*+?*?%S;,,,..,?%:.,::?#@@S+;S,......... 
.....;:,:;:,??..,,,.*#;,,.+%@@%%%++.......... 
...,;,:?@@+,;?#,..,:;*,:,;?*??**%*:,........ 
...:+:%###+,.+#?..,,:S%::;*####*+++::,....... 
...::*S@#;:,,;;*;:;::;*,+S#@@S%??;;,......... 
...:+S##%:...,;;+++::,:+;+%###SS:,,:.........""")
sleep(2)

print(
    "С тихим шуршанием песка и жутким свистом ветра, два великих воина встретились лицом к лицу на раскаленной пустынной арене.")
sleep(1)
print("Саб Зиро, смертельно опасный мастер ниндзя-искусства, стоял на одном конце арены, готовый к битве.")
sleep(1)
print(
    "Его противник, легендарный ниндзя Скорпион, с ненасытной жаждой мести, подошел к нему с опасным блеском в глазах.")
sleep(1)
print(
    "Оба воина приготовились к непримиримой битве до последнего вздоха, зная, что только один из них сможет покинуть арену живым.")
sleep(1)

print("""\033[35m______  _____  _____  _   _  _____ 
|  ___||_   _||  __ \| | | ||_   _|
| |_     | |  | |  \/| |_| |  | |  
|  _|    | |  | | __ |  _  |  | |  
| |     _| |_ | |_\ \| | | |  | |  
\_|     \___/  \____/\_| |_/  \_/  


""")
sleep(1)

while unit1.health > 0 and unit2.health > 0:
    if randint(0, 1) == 1:
        unit1.attack(unit2)
    else:
        unit2.attack(unit1)

if unit1.health <= 0:
    print(f"\033[36m{unit2.name} одержал победу!")
    sleep(1)
else:
    print(f"\033[36m{unit1.name} одержал победу!")
    sleep(1)





